tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "yqrashawn/goku"
tap "candid82/brew"
tap "aws/tap"
tap "koekeishiya/formulae"
tap "cmacrae/formulae"
tap "d12frosted/emacs-plus"

##################


cask "font-fira-code"

brew "yqrashawn/goku/goku"
cask "alfred"
cask "microsoft-outlook"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "iterm2"
cask "transmission"
cask "spotify"
cask "onedrive"
cask "kap"
cask "keybase"
cask "obs"
cask "vlc"
cask "1password"
cask "brave-browser"

cask "notion"

cask "visual-studio-code"
cask "altair-graphql-client"

cask "discord"
cask "telegram-desktop"
cask "slack"
cask "zoom"
cask "loopback"
# cask "inkscape"
cask "loom"
cask "skitch"
cask "windscribe"
cask "whatsapp"
cask "selfcontrol"

# CLI

brew "ag"
brew "awscli"
brew "aws-sam-cli"
brew "aws-iam-authenticator"
brew "dhall"
brew "dhall-bash"
brew "dhall-json"
brew "dhall-yaml"
brew "dhall-lsp-server"
brew "git"
brew "git-lfs"
brew "graphviz"
brew "ripgrep"
brew "ispell"
brew "coreutils"
brew "fd"
brew "neovim"
brew "pyenv"
brew "nvm"
brew "openjdk"
brew "haskell-stack"
brew "z"     # Autojumping tool
brew "python@3.8"
brew "youtube-dl"
brew "tesseract"  # OCR

# Soup Machine Development
tap "ArmMbed/homebrew-formulae"
brew "hidapi"
brew "libusb"
brew "rtmidi"
brew "doxygen"
brew "arm-none-eabi-gcc"
