tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "yqrashawn/goku"
tap "aws/tap"
tap "koekeishiya/formulae"
tap "cmacrae/formulae"
tap "d12frosted/emacs-plus"

##################


cask "font-fira-code"
cask "font-fontawesome"
cask "font-proggy-clean-tt-nerd-font"
cask "font-iosevka-ss14"

brew "yqrashawn/goku/goku"
cask "alfred"
cask "microsoft-outlook"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "iterm2"
cask "lulu"
cask "transmission"
cask "spotify"
cask "onedrive"
cask "kap"
cask "keybase"
cask "obs"
cask "vlc"
cask "webtorrent"
# cask "1password" -- Install it from website

cask "notion"
cask "obsidian"
cask "krita"
brew "emacs-plus"

cask "visual-studio-code"
cask "altair-graphql-client"

cask "discord"
cask "telegram-desktop"
cask "slack"
cask "zoom"
cask "loopback"
# cask "inkscape"
cask "gimp"
cask "loom"
cask "microsoft-edge"
cask "parsec"
cask "splashtop-personal"
cask "splashtop-streamer"

# CLI

brew "ag"
brew "awscli"
brew "azure-cli"
brew "aws-sam-cli"
brew "aws-iam-authenticator"
brew "bat"
brew "cmake"
brew "eksctl"
brew "helm@3"
brew "imagemagick"
cask "lens"
brew "kubectl"
brew "dhall"
brew "dhall-bash"
brew "dhall-json"
brew "dhall-yaml"
brew "dhall-lsp-server"
brew "git"
brew "git-lfs"
brew "graphviz"
brew "ripgrep"
brew "ispell"
brew "coreutils"
brew "fd"
brew "neovim"
brew "pyenv"
brew "nvm"
brew "openjdk"
brew "haskell-stack"
brew "z"     # Autojumping tool
brew "python@3.8"
brew "youtube-dl"

# Soup Machine Development
tap "ArmMbed/homebrew-formulae"
brew "hidapi"
brew "libusb"
brew "rtmidi"
brew "doxygen"
brew "arm-none-eabi-gcc"